app/Http/Controllers/SpendController.php

    public function index()
    {

        $spends = Spend::orderBy('created_at', 'desc')->paginate(5);

        $users = User::with(['spends' => function ($query) {
            $query->selectRaw('SUM(`spend_user`.`price`) as `total`, `spends`.*')
            ->groupBy("user_id");
        }])->get();
---
select * from `spends` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `spends`
select `spends`.*, `spend_user`.`user_id` as `pivot_user_id`, `spend_user`.`spend_id` as `pivot_spend_id`, `spend_user`.`price` as `pivot_price` from `spends` inner join `spend_user` on `spends`.`id` = `spend_user`.`spend_id` where `spend_user`.`user_id` in ('1', '2', '3', '4')
select * from `users`
select sum(`spend_user`.`price`) as `total`, `spends`.*, `spend_user`.`user_id` as `pivot_user_id`, `spend_user`.`spend_id` as `pivot_spend_id`, `spend_user`.`price` as `pivot_price` from `spends` inner join `spend_user` on `spends`.`id` = `spend_user`.`spend_id` where `spend_user`.`user_id` in ('1', '2', '3', '4') group by `user_id`

    public function create()
    {
        $users = User::all();
---
select * from `users`

    public function show($id)
    {
        $spend = Spend::findOrFail($id);
        $users = User::all();
---
select * from `spends` where `spends`.`id` = '2' limit 1
select * from `users`

    public function balance(){



        // get total spend by one user
        $usersSpend = array();
        //$users = User::all();
        $users = User::with(['spends' => function ($query) {
            $query->selectRaw('SUM(`spend_user`.`price`) as `total`')
            ->groupBy("user_id");
        }, 'part'])->get();

        // get total spend by all users
        $spends = Spend::all();
        $totalSpend = $spends->sum('price');


        // get part
        $parts = Part::all();
---
select sum(`price`) as aggregate from `spends`
select * from `parts` where `parts`.`user_id` in ('1', '2', '3', '4')
select * from `spends`
select * from `users`
select * from `parts`

                    $usersSpend[$inc]['due'] = $spend->total - ($partSpend * intval($user->part->day));
                    $usersSpend[$inc]['part'] = intval($user->part->day);
                }
                $balance = Balance::find($user->id);
                if($balance){
                    $balance->due = $usersSpend[$inc]['due'];
                    $balance->save();
---
select * from `balances` where `balances`.`id` = '1' limit 1
update `balances` set `due` = '416.29333333333', `updated_at` = '2017-12-19 09:35:36' where `id` = '1'

                    $balance = new Balance;
                    $balance->user_id = $user->id;
                    $balance->due = $usersSpend[$inc]['due'];
                    $balance->save();
---
insert into `balances` (`user_id`, `due`, `updated_at`, `created_at`) values ('1', '416.29333333333', '2017-12-19 09:12:01', '2017-12-19 09:12:01')

        }


        $balances = Balance::all();
---
select * from `balances`