app/Http/Controllers/SpendController.php

select * from `parts` where `parts`.`user_id` = '1' and `parts`.`user_id` is not null limit 1
---
    public function balance(){



        // get total spend by one user
        $usersSpend = array();

        $expiresAt = Carbon::now()->addMinutes(10);
        // get total spend by all users
        $spends = Spend::where('trip_id' ,'=', $this->trip_id)->get();
        $refreshing = true;
        $totalSpend = $spends->sum('price');


        $key = \Route::getCurrentRoute()->getName();

        if(Cache::has($key.'.spendCount')){
            $spendCount = Cache::get($key.'.spendCount');
            $refreshing = ($spendCount != count($spends)) ? true : false;
        }else{
            Cache::put($key.'.spendCount', count($spends), $expiresAt);
        }




        if(Cache::has($key.'.users') && Cache::has($key.'.parts')){
           $users = Cache::get($key.'.users');

select * from `users` where `users`.`id` in ('1', '2', '3', '4')
---

        }else{
            $parts = Part::all();
            $users = User::with(['spends' => function ($query) {
                $query->selectRaw('SUM(`spend_user`.`price`) as `total`, `spends`.*')
                ->groupBy("user_id");
            }, 'part'])->where('trip_id' ,'=', $this->trip_id)->get();